{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend source files.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app and mounting the root element.",
  "frontend/src/App.tsx": "Main React app initializing IndexedDB and providing routing and theming.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper with header, theme toggle, content area, and mobile nav.",
  "frontend/src/components/ConfirmDeleteDialog.tsx": "Reusable alert dialog for confirming destructive delete actions.",
  "frontend/src/components/DateSelector.tsx": "Reusable date input component with calendar icon and label.",
  "frontend/src/components/MobileNav.tsx": "Mobile bottom navigation bar with icons and active state styling.",
  "frontend/src/components/ThemeToggle.tsx": "Button to switch between light and dark themes using context.",
  "frontend/src/features/accounting/AccountingForm.tsx": "Form for creating or editing accounting transactions with validation.",
  "frontend/src/features/accounting/AccountingList.tsx": "Displays accounting transactions with totals and provides edit/delete actions.",
  "frontend/src/features/accounting/calculations.ts": "Computes total income, expenses, and balance from a list of accounting transactions.",
  "frontend/src/features/accounting/validation.ts": "Validates accounting form fields for required values and positive numeric amounts.",
  "frontend/src/features/dashboard/KpiCard.tsx": "Reusable animated card showing a KPI value, title, and icon.",
  "frontend/src/features/dashboard/kpis.ts": "Calculates daily dashboard KPIs using accounting totals, vehicle logs, and water tank entries.",
  "frontend/src/features/reports/AccountingReport.tsx": "Loads accounting transactions for a date, displays them in a table, and supports PDF/Excel export.",
  "frontend/src/features/reports/ExportActions.tsx": "Dropdown component providing buttons to export reports to PDF or Excel.",
  "frontend/src/features/reports/VehicleWorkReport.tsx": "Shows vehicle work logs for a date with totals and export options for PDF/Excel.",
  "frontend/src/features/reports/WaterTankReport.tsx": "Displays water tank entries for a date with export functionality.",
  "frontend/src/features/vehicleWork/calculations.ts": "Contains helper functions to compute working hours and payment amounts.",
  "frontend/src/features/vehicleWork/validation.ts": "Validates vehicle work log input fields and returns error messages for missing or invalid data.",
  "frontend/src/features/vehicleWork/VehicleWorkForm.tsx": "Form for creating or editing vehicle work logs with live hour and payment calculations.",
  "frontend/src/features/vehicleWork/VehicleWorkList.tsx": "Displays vehicle work logs with totals and provides edit/delete actions with a confirmation dialog.",
  "frontend/src/features/waterTank/validation.ts": "Validates water tank form data, ensuring required fields are provided.",
  "frontend/src/features/waterTank/WaterTankForm.tsx": "Form component for creating or editing water tank entries with validation and submission handling.",
  "frontend/src/features/waterTank/WaterTankList.tsx": "Renders a list of water tank entries with optional notes and edit/delete controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout functions, and identity loading logic.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom warm color variables for light and dark themes.",
  "frontend/src/lib/export/excel.ts": "Generates CSV content from table data and triggers a file download as a .csv file.",
  "frontend/src/lib/export/exportTypes.ts": "Defines TypeScript interfaces for export metadata, columns, rows, and totals.",
  "frontend/src/lib/export/pdf.ts": "Builds a printable HTML document from table data and uses the browser print dialog to export as PDF.",
  "frontend/src/lib/format.ts": "Provides safe formatting helpers for currency, numbers, dates, and time, plus utilities for current date/time.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind and conditional class names.",
  "frontend/src/localDb/client.ts": "Implements IndexedDB initialization and CRUD helpers for getting, adding, updating, and deleting records.",
  "frontend/src/localDb/index.ts": "Re-exports database initialization, repositories, and local DB types as the public API.",
  "frontend/src/localDb/migrations.ts": "Contains migration logic to create initial IndexedDB stores and future version handling.",
  "frontend/src/localDb/repositories/accountingRepo.ts": "Provides CRUD functions for accounting transactions using the shared DB client.",
  "frontend/src/localDb/repositories/vehicleWorkRepo.ts": "Provides CRUD functions for vehicle work logs using the shared DB client.",
  "frontend/src/localDb/repositories/waterTankRepo.ts": "Provides CRUD functions for water tank entries using the shared DB client.",
  "frontend/src/localDb/schema.ts": "Defines DB name, version, store names, and schema metadata interfaces.",
  "frontend/src/localDb/types.ts": "Declares local-only TypeScript types for water tank entries, vehicle work logs, and accounting transactions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AccountingPage.tsx": "Implements the accounting page with date filtering, CRUD operations, list display, and a form dialog.",
  "frontend/src/pages/DashboardPage.tsx": "Loads today's KPIs from local DB data and displays them in dashboard KPI cards.",
  "frontend/src/pages/ReportsPage.tsx": "Renders a reports page with a date selector and tabbed views for water tank, vehicle work, and accounting reports.",
  "frontend/src/pages/VehicleWorkPage.tsx": "Provides CRUD UI for vehicle work logs with date filtering, listing, and a dialog form for adding or editing logs.",
  "frontend/src/pages/WaterTankPage.tsx": "Manages water tank entries with date-based filtering, list display, and a dialog form for creating or editing entries.",
  "frontend/src/router.tsx": "Defines the app’s route tree including dashboard, water tank, vehicle work, accounting, and reports pages using TanStack Router.",
  "frontend/src/theme/theme.ts": "Provides theme mode types and helpers for reading, writing, and detecting stored or system theme preferences.",
  "frontend/src/theme/ThemeProvider.tsx": "Implements a theme context provider that persists light/dark mode and applies it to the document root.",
  "frontend/src/types/jspdf-autotable.d.ts": "Empty type placeholder for jspdf-autotable.",
  "frontend/src/types/jspdf.d.ts": "Empty type placeholder for jspdf.",
  "frontend/src/types/xlsx.d.ts": "Empty type placeholder for xlsx.",
  "frontend/tailwind.config.js": "Tailwind configuration with dark mode, custom colors, typography, container queries, animations, and extended theme settings.",
  "project_state.json": "Project metadata describing app purpose, architecture notes, features, and versioned state."
}